//1
let course = +(prompt("Курсыңызды енгізіңіз: 1/2/3/4"));
let isAlmaty = prompt("Келген жеріңіз Алматы ма? yes/no");

if (course < 3 && isAlmaty=="no") {
    alert("Құттықтаймыз! Сізге Жатақханадан орын беріледі");
}
else {
    alert("Өкінішке қарай сізге Жатақханадан орын берілмейді");
}

//2
alert("Ойын шарты: Дұрыс жауап берілген әр сұраққа 1 балл беріледі. Сұрақ қойылады жауапты енгізесіз")

let surak1 = prompt("Қазақстан тәуелсіздігін қашан алды?")
let surak2 = prompt("Қазір қай қалада оқып жатырсыз?")

if(surak1==1991 && surak2=="Almaty"){
    alert("Сіз 2 ұпай жинадыңыз")
}
else{
    alert("Сіз 1 ұпай жинадыңыз")
}